{
  "KEYWORDS": {
    "Refund / Cancel Player / Cancel payment / Stop payment / Player removals": "Many expenses are incurred immediately following each player’s registration as well as a spot on the team is reserved for the player eliminating a spot for a different player wanting to join. We are very sorry but as written in your player agreement, no refunds will be issued after the player has been registered.",
    "Password Reset": "Should you need to reset your password, please visit <a href='https://usaprimsports.com/login' target='_blank' rel='noopener noreferrer'>www.usaprimsports.com/login</a>, click “Forgot Password” and then enter the phone number or email address associated with your account. Once submitted, you will receive an email or text message to reset your password.",
    "Player Registration/ Registration link / Registration issues / Register": "Your team's coach will send you a registration link through text and/or email. If you have any questions about when to expect the registration link invite, please contact your coach.",
    "Payment options / Payment Plan / Split Payment / Split Player Fee/ Pay in Full": "&#8226; Assuming you are not registering after the registration deadline you may have the option to pay in full or split the player fee into equal monthly payments.<br>&#8226; The option for monthly payments depends on when you register your player. If you register your player later in the season, the monthly payment options may be limited or unavailable.",
    "Incomplete registration": "If your player's registration is incomplete, you will receive daily email notifications detailing the information required to complete their registration. To complete your players registration, please login and complete all missing fields.",
    "Popcorn / Fundraising / Popcorn Fundraiser": "&#8226; The Annual Popcorn Fundraiser allows registered players to earn 50% of every dollar raised to assist with the expense of annual player fees. <br>&#8226;Please visit this platform and click on “Fundraisers” on the left-hand side of the screen for all the details!",
    "national program": "&#8226; USA Prime is currently one of the highest rated national programs across the country with an unprecedented number of Division 1 players and MLB drafted players past and present. <br>&#8226; If you believe you have a national caliber player who is interested in playing for our national program, please email <a href='mailto:mnellist@usaprimenational.org'>mnellist@usaprimenational.org</a> or <a href='mailto:Dalvis@usaprimenational.org'>Dalvis@usaprimenational.org</a>. <br> Please include the players name, perfect game profile, and any relevant information.",
    "numbers": "Once you select your player's jersey size during registration, the jersey number drop-down will automatically display all available numbers. Your player is free to choose any number listed in the drop-down that corresponds to their size.",
    "Uniform / Pants  / Jersey sample package / Jersey sizes / Sizing kits / Hat size / Uniform Package": "&#8226; Each player will receive 3 full button-down, fully sublimated, breathable, Major-League Baseball-looking jerseys, 2 fitted hats and a helmet decal. <br>&#8226; Starting fall 2024 all uniforms will be shipped directly to each players home.",
    "PEX to ACH / Tournament Funds to ACH": "ICC’s have the decision at the time they register each team season to have all their team's tournament budgets either loaded onto coach PEX cards or ACH’ed into their business checking account. If you want to change your selection, please submit a ticket and one of our Operations Managers will assist you.",
    "Coaches Gear / Coach Hats": "Each team will get 2 sets of hats (navy & white) for 2 coaches.",
    "Store / Batting gloves / Hoodie / Sweatshirt / Tank / Shirt": "&#8226; If you would like to shop on our team store, please use the following link / copy and paste to: <a href='https://usaprimebaseball.com/teamstore/' target='_blank' rel='noopener noreferrer'>https://usaprimebaseball.com/teamstore/</a>. <br>&#8226; All purchases that total $100 or more not including sales tax will receive free shipping, handling, and payment processing fees. If the total purchase is below $100 not including sales tax, then a $10 shipping/handling/processing fee will apply. <br>&#8226; All orders placed prior to 10 am CST Monday – Friday will be shipped on the same day.",
    "credit card": "With the goal of NOT having, you spend additional credit card processing fees we only process electronic checks for player registration. Please use your checking account bank routing & account number to complete payment for your players registration.",
    "1099 / Taxes": "1099s will be issued in January/February each year.",
    "Tryout / try out / Interested in USA Prime / Want to play for USA Prime": "A Please go to <a href='https://usaprimesports.com/workflow/locations' target='_blank' rel='noopener noreferrer'>https://usaprimesports.com/workflow/locations</a> to see all our locations across the country. Is there a USA Prime location near you that your player would like to tryout for?",
    "Billing Address for PEX / Billing Zip Code for PEX": "&#8226; The billing address for all PEX cards is our Home Base (Corporate) Office in Dallas, TX <br>&#8226; 17440 Dallas Parkway Suite 116 (you must enter suite number) Dallas, Texas 75287",
    "PEX Card / Tournament Funds / Tournament Budget / Budget card / Tournament money / Tourney money": "If the ICC elected to utilize PEX cards for tournament budgets, the head coach will receive the PEX card. If funds are available, the registration platform will load each PEX card when teams have a minimum of 6 registered players.",
    "Account info / Change ACH / Change Routing/Account / Change Payment Info": "&#8226; To change your bank account routing and/or account number on file, please submit a ticket and one of our Operations Managers will assist you. <br>&#8226; Please note: If a payment is currently processing, we will be unable to change your payment information until after the payment has been processed.",
    "ACH Return / Bounced Payment / Bounced Check / $25 dollar charge": "&#8226; If your player fee payment does not go through, we will reach out to you to reconcile. <br>&#8226; Per the player agreement “The USA Prime platform may charge an ACH return and/or bounced check fee of $25 per occurrence.”",
    "Calendar Scheduling": "&#8226; Calendar scheduling gives the coach or ICC the ability to create a season long schedule for parents and guardians to RSVP. <br>&#8226; (Coach) If an update is needed, simply click “Edit Event” to change anything about the pre scheduled event. <br>&#8226; If you would like to notify all registered players and coaches with a SMS text, you will need to check the “send out a team notification”. This will notify them of the update. If you would like to RSVP to a scheduled event log on to your account and click on the player who you wish to RSVP for, click on the event and choose yes, no, or maybe from the RSVP options.",
    "Regional": "&#8226; This program was created to benefit ICC’s working with other ICCs in their Region to put together one-off best-of-breed teams with the goal of winning the best Regional or National events in the area. <br>&#8226; If you believe your son or daughter would like to tryout out for a regional team, please reach out to your USA Prime Organization and inquire about the process of trying out.",
    "Coach Pay": "&#8226; Youth Spring coaches pay is paid out on 2/15, 3/15, 4/15, 5/15 and 6/15.<br>&#8226; High School Summer coaches pay is paid out on 6/15, 7/15 and 8/15.<br>&#8226; Youth and High School Fall coaches pay is paid out on 9/15, 10/15 and 11/15.<br>&#8226; Your coach pay will be ACH’ed directly to his/her bank account provided by the coach they set up in the platform. Please review the bank account information we have on file in the platform to ensure your pay will be dispersed correctly.",
    "Insurance / Certificate of Insurance / COI / Additionally Insured": "An ICC or head coach can login to the platform and go to their ICC/Coach account and access the Resource Center located at the bottom of their homepage. Within the Resource Center, is a resource titled 'Team Insurance Link & Instructions' which provides a step-by-step guide on creating an Additionally Insured Certificate of Insurance.",
    "Canva / Flyer Templates / Social Media Templates / Seeking Players Flyer / Seeking Coaches Flyer": "An ICC or head coach can login to the platform and go to their ICC/Coach account and access the Resource Center located at the bottom of their homepage. Within the Resource Center, is a resource titled 'Canva Credentials & Info' which provides the login information to access our flyer/social media templates",
    "Resource center / player tryout flyer / looking for coaches flyer / end of season player evaluation cards": "A To create flyers using one of our many templates, please login to your ICC or coach account. Once logged in, navigate to the Resource Center on your homepage, where you'll find a resource titled 'Canva Credentials & Info' Follow the provided instructions to access our flyer templates. A We have uploaded your custom USA Prime logo to your ICC profile. After logging into your account, please go to your ICC profile and click on the yellow “UPLOADS” button to view/download your logos.",
    "ICC Pay / ICC Funds": "&#8226; ICC funds are released on the 15th of each month. <br>&#8226; ICC pay will be ACH’ed directly to you using the bank account you set up in the platform. Please review the bank account information we have on file in the platform to ensure your pay will be dispersed correctly."
  }
}